package com.loolbuy.global.util;

/**
 * 客户端显示的 message 的编号
 *
 */
public enum MessageCode
{

    /**
     * SUCCESS:处理成功
     */
    SUCCESS,
    
    
    /**
     * E0001:交易密码输入不正确
     */
    E0001,
    
    /**
     * E0002:密码格式不正确
     */
    E0002,

    /**
     * E0003:登录密码格式不正确
     */
    E0003,

    /**
     * E0004:密码和密码确认不一致，请重新输入
     */
    E0004,

    /**
     * E0005:旧密码输入不正确
     */
    E0005,
    
    /**
     * E0006:手机号码不合法
     */
    E0006,

    /**
     * E0007:图形验证码输入不正确
     */
    E0007,
    
    /**
     * E0008:您的交易密码错误次数已经达到上限（{0} 次），请明日再试
     */
    E0008,

    /**
     * E0009:您输入的密码不正确
     */
    E0009
}

